ignite/app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Project"], ["description", "This is the first project"], ["created_at", "2015-05-18 12:57:32.304734"], ["updated_at", "2015-05-18 12:57:32.304734"]]
---
  def create
    @project = Project.new(project_params)
    @project.set_expiration_date(project_params[:expiration_date])
    if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 10]]
---
  def show
    @project = Project.find(params[:id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 17]]
---
  def edit
    @project = Project.find(params[:id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 29]]
UPDATE "projects" SET "description" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["description", "Project has been updated"], ["updated_at", "2015-05-18 13:49:04.050069"], ["id", 29]]
---
  def update
    @project = Project.find(params[:id])
    @project.update(project_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 44]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 44]]
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy